blog/app/views/articles/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = ?  [["article_id", 3]]
---
			<%= social_share_button_tag(@article.title, :popup => "true") %>
			<h2><%= @article.comments.count %> Comments</h2>