blog/app/controllers/articles_controller.rb

	def index
		@articles = Article.all.reverse
---
SELECT "articles".* FROM "articles"