blog/app/controllers/comments_controller.rb

SELECT "comments".* FROM "comments"
---
	def index
		@comment = Comment.all

SELECT "sub_comments".* FROM "sub_comments" WHERE "sub_comments"."comment_id" = ?  [["comment_id", 2]]
---
	def show
		@comment = Comment.find(params[:id])